examples/surfaceMountedCube/simpleGradFoam/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    cube
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    topAndBottom
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    sides
    {
        type            slip;
    }
    inlet
    {
        type            fixedValue;
        value           nonuniform List<vector> 
3600
(
(0.362717 0.00365109 0.00660729)
(0.362717 0.00365109 0.00660729)
(0.379362 -0.00389196 0.00223016)
(0.379362 -0.00389196 0.00223016)
(0.379451 -0.00112341 -0.00104893)
(0.379451 -0.00112341 -0.00104893)
(0.387107 -0.00685716 -0.0125389)
(0.369938 0.00154017 0.0022356)
...
)
;
    }
    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
