examples/surfaceMountedCube/simpleGradFoam/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleGradFoam;

startFrom       startTime;

startTime       0.0;

stopAt          endTime;

endTime         24000;

deltaT          1;

writeControl    timeStep;

writeInterval   2000;

purgeWrite      3;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    probes
    {
        type            probes;
        libs            ("libsampling.so");
        writeControl    timeStep;
        writeInterval   1;

        fields
        (
            U p
        );

        probeLocations
        (
            (5.0 4.5 0.5)
            (5.0 4.5 1.0)
            (6.0 4.5 0.5)
            (6.0 4.5 1.0)
            (7.0 4.5 0.5)
            (7.0 4.5 1.0)
            (8.0 4.5 0.5)
            (8.0 4.5 1.0)
            (9.0 4.5 0.5)
            (9.0 4.5 1.0)
            (10.0 4.5 0.5)
            (10.0 4.5 1.0)
        );

    }

    fieldAverage1
    {
        type            fieldAverage;
        libs            ("libfieldFunctionObjects.so");
        writeControl    writeTime;
        timeStart       6000;

        fields
        (
            U
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }

            p
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }
        );
    }
}

// ************************************************************************* //
