examples/surfaceMountedCube/simpleGradFoam/system/createPatchDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Do a synchronisation of coupled points after creation of any patches.
// Note: this does not work with points that are on multiple coupled patches
//       with transformations (i.e. cyclics).
pointSync false;

// Patches to create.
patches
(
    {
        //- Master side patch
        name            SideWall_1;
        patchInfo
        {
            type            cyclic;
            matchTolerance  0.0001;
            neighbourPatch  SideWall_2;
        }
        constructFrom patches;
        patches (SideWall_1);
    }

    {
        //- Slave side patch
        name            SideWall_2;
        patchInfo
        {
            type            cyclic;
            matchTolerance  0.0001;
            neighbourPatch  SideWall_1;
        }
        constructFrom patches;
        patches (SideWall_2);
    }
);

// ************************************************************************* //